app/controllers/v1/articles_controller.rb

  def index

    if params[:user_id].present?
      @articles = Article.where(user_id: params[:user_id])
    else
      @articles = Article.all
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @articles = Article.find_by(id: params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]