app/controllers/v1/users_controller.rb

  def index
    if params[:user_id].present?
      @users = User.where(user_id: params[:user_id])
    else
      @users = User.all
    end
    #Searching
    #  if params[:var].present?
    #   @users = @users.where('name LIKE ?', '%' + params[:var] + '%')
    #  end

    if params[:name].present?
      @users = @users.where('name LIKE ?', '%' + params[:name] + '%')
     end

    #Sorting
    # @users.order("name ASC")
                            #UserDefinedMethod || The DefaultCase
     @users = @users.order(" #{params[:method] || 'name' } #{params[:sort_by] || 'ASC' }")


    #Pagination
     #rails 5 => @users.page(params[:page]).per(params[:per])

    #rails 7
     @users = @users.offset(params[:page]).limit(params[:per])
---
SELECT "users".* FROM "users" WHERE "users"."user_id" = ? ORDER BY  name ASC  [["user_id", "1"]]
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."name" = ?  [["name", ""]]
SELECT "users".* FROM "users" ORDER BY  hobby DESC

  def create
    @user = User.create(user_params) # Strong parameters
---
INSERT INTO "users" ("created_at", "updated_at", "name", "age", "hobby") VALUES (?, ?, ?, ?, ?)  [["created_at", "2022-11-02 20:57:38.148201"], ["updated_at", "2022-11-02 20:57:38.148201"], ["name", "The Weeknd"], ["age", 34], ["hobby", "Music"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "hobby" = ? WHERE "users"."id" = ?  [["updated_at", "2022-11-03 19:27:35.818432"], ["hobby", "Rapping"], ["id", 5]]

  def search_user
    @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]